config/Catalogs/КонтрактыИАптеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КонтрактыИАптеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контракты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАптекиВнутр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАптекиВнешн</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФирмы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАптекиТразитный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/КонтрактыИАптеки/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ТХТ = "ВЫБРАТЬ
		|	КонтрактыИАптеки.Владелец
		|ИЗ
		|	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		|ГДЕ
		|	КонтрактыИАптеки.Аптека = &Аптека
		|	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика
		|";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("Аптека",Аптека);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данная аптека уже имеет привязку к контракту: " + Выборка.Владелец,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
		
		ТХТ = "ВЫБРАТЬ
		      |	КонтрактыИАптеки.Владелец,
		      |	КонтрактыИАптеки.Аптека
		      |ИЗ
		      |	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		      |ГДЕ
		      |	КонтрактыИАптеки.КодАптекиВнешн = &КодАптекиВнешн
		      |	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("КодАптекиВнешн",КодАптекиВнешн);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данный код уже привязан к аптеке: " + Выборка.Аптека,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
	Иначе
		ТХТ = "ВЫБРАТЬ
		      |	КонтрактыИАптеки.Владелец,
		      |	КонтрактыИАптеки.Аптека
		      |ИЗ
		      |	Справочник.КонтрактыИАптеки КАК КонтрактыИАптеки
		      |ГДЕ
		      |	КонтрактыИАптеки.КодАптекиВнешн = &КодАптекиВнешн
		      |	И КонтрактыИАптеки.Владелец.КодПоставщика = &КодПоставщика
		      |	И КонтрактыИАптеки.Аптека <> &Аптека";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		
		Запрос.УстановитьПараметр("КодПоставщика",Владелец.КодПоставщика);
		Запрос.УстановитьПараметр("КодАптекиВнешн",КодАптекиВнешн);
		Запрос.УстановитьПараметр("Аптека",Аптека);
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			Сообщить("Данный код уже привязан к аптеке: " + Выборка.Аптека,СтатусСообщения.Важное);	
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
